src/Documents/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Затраты</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.СписаниеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Затраты/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументЗатрат, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаЗатрат.Ссылка КАК Документ,
	|	ТаблицаЗатрат.Ссылка.СтруктурнаяЕдиница,
	|	ТаблицаЗатрат.НомерСтроки,
	|	ТаблицаЗатрат.Период,
	|	ТаблицаЗатрат.СтатьяЗатрат,
	|	ТаблицаЗатрат.Сотрудник,
	|	ТаблицаЗатрат.Контрагент,
	|	ТаблицаЗатрат.Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗатрат
	|ИЗ
	|	Документ.Затраты.СтатьиЗатрат КАК ТаблицаЗатрат
	|ГДЕ
	|	ТаблицаЗатрат.Ссылка = &ДокументЗатрат";
	
	
	Запрос.УстановитьПараметр("ДокументЗатрат", ДокументЗатрат);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицуЗатрат(ДокументЗатрат, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЗатрат(ДокументЗатрат, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВременнаяТаблицаЗатрат.НомерСтроки) КАК НомерСтроки,
	|	ВременнаяТаблицаЗатрат.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗатрат.Период,
	|	ВременнаяТаблицаЗатрат.СтатьяЗатрат,
	|	ВременнаяТаблицаЗатрат.Сотрудник,
	|	ВременнаяТаблицаЗатрат.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	СУММА(ВременнаяТаблицаЗатрат.Сумма) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗатрат КАК ВременнаяТаблицаЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаЗатрат.Период,
	|	ВременнаяТаблицаЗатрат.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗатрат.СтатьяЗатрат,
	|	ВременнаяТаблицаЗатрат.Сотрудник,
	|	ВременнаяТаблицаЗатрат.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатраты", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти
